/*
 *
 *  堆排序（大顶堆/小顶堆） -- 本质：种特殊的完全二叉树
 * 特点：时间复杂度：O(nlogn)、空间复杂度：O(1)，是否稳定：不稳定
 *   - 大顶堆：每个父节点都 >= 它的子节点
 * 
 * 数组： [9, 6, 8, 3, 5, 1]
 *        9
        /   \
        6     8
       / \   /
      3   5  1
 * 关系： 
      left = 2 * i + 1;      // 左孩子
      right = 2 * i + 2;     // 右孩子
      parent = Math.floor((i - 1) / 2); // 父节点
 */
/**
 * @param {number[]} nums
 * @return {number[]}
 */
var heapSort = function(nums) {
    // 解题思路：1. 先把 数组原地 建成大顶堆（大顶堆的堆顶一定是当前最大值）
    // 2. 每次把 堆顶元素 和 当前堆的最后一个元素 交换（把最大值放到最终位置）
    // 3. 交换后缩小堆的范围，再对堆顶做下沉调整，，恢复大顶堆性质 
    // 重复 2. 3

    // 数组长度
    const n = nums.length;

    // 建大顶堆：从最后一个 非叶子节点 开始
    for(let i = Math.floor(n / 2); i >= 0; i--){
        
    }
}
